Repository: SDmaN/vscode-semantic
Catalog: src/language-tools/src/CompillerServices/Resources/Frontend/SecondStepVisitor.*.resx
Languages: ru

source: '{0}' does not take specified arguments.
ru: '{0}' не принимает заданные аргументы.

source: '{0}' has '{1}' access modifier.
ru: '{0}' имеет тип доступа '{1}'.

source: '{0}' has not an array type.
ru: '{0}' не является массивом.

source: '{0}' is not a function and can't be used in expression.
ru: '{0}' не является функцией и не может быть использована в выражении.

source: '{0}' is not a function or procedure type.
ru: '{0}' не является типом процедуры или функции.

source: '{0}' takes {1} arguemnts.
ru: '{0}' принимает '{1}' аргументов.

source: Array '{0}' cannot be declared because another variable or constant with same name already exists.
ru: Массив '{0}' не может быть объявлен, так как другая переменная или константа с данным именем уже объявлена.

source: Array '{0}' has {1} dimentions, but specified {2}.
ru: Количество размерностей массива '{0}' - {1}, но указано {2}.

source: Cannot convert type '{0}' to array element type '{1}'.
ru: Невозможно преобразовать тип '{0}' к типу элемента массива '{1}'

source: Cannot convert type '{0}' to constant type '{1}'.
ru: Невозможно преобразовать тип '{0}' к типу константы '{1}'.

source: Cannot convert type '{0}' to type '{1}'.
ru: Невозможно преобразовать тип '{0}' к типу '{1}'.

source: Cannot convert type '{0}' to variable type '{1}'.
ru: Невозможно преобразовать тип '{0}' к типу переменной '{1}'.

source: Cannot input variable of type '{0}'.
ru: Невозможно ввести значение для переменной типа '{0}'.

source: Cannot output expression of type '{0}'.
ru: Невозможно вывести значение выражения типа '{0}'.

source: Constant '{0}' cannot be declared because another variable or constant with same name already exists.
ru: Константа '{0}' не может быть объявлена, так как другая переменная или константа с данным именем уже объявлена.

source: Function or procedure '{0}' is not declared in module '{1}'.
ru: Функция или процедура '{0}' не объявлена в модуле '{1}'.

source: Functor '{0}' takes {1} arguments, not {2}.
ru: Функтор '{0}' принимает {1} аргументов, а не {2}.

source: Impossible to assign a value to constant '{0}'.
ru: Невозможно присвоить значение константе '{0}'.

source: Maximum value of length index for '{0}' is {1}.
ru: Максимальное значение индекса длины для '{0}' - {1}.

source: Missing expression in return operator.
ru: Отсутствует выражение для оператора return.

source: Module '{0}' already imported.
ru: Модуль '{0}' уже импортирован.

source: Module '{0}' is not declared.
ru: Модуль '{0}' не был объявлен.

source: Module '{0}' is not defined.
ru: Модуль '{0}' не объявлен.

source: Module '{0}' is not imported.
ru: Модуль '{0}' не импортирован.

source: Name '{0}' is not declared in current context.
ru: Имя '{0}' не объявлено в текущем контексте.

source: Name {0} corresponds to keyword.
ru: Имя '{0}' совпадает с ключевым словом.

source: No overloads '{0}' takes specified arguments.
ru: Ни одна перегрузка '{0}' не принимает заданные аргументы.

source: No overloads of '{0}' that takes {1} arguments found.
ru: Ни одна из перегрузок '{0}', которая принимает {1} аргументов, не найдена.

source: Not all code path returns a value.
ru: Не все пути выполнения возвращают значение.

source: Only functions can return a value.
ru: Только функции могут возвращать значение.

source: Only variable or routines can be passed by reference.
ru: Только переменные могут быть переданы по ссылке.

source: Only variables can be passed by reference.
ru: Только переменные могут быть переданы по ссылке.

source: Operator '{0}' can't be applied to operand of type '{1}'
ru: Оператор '{0}' не может быть использован с аргументом типа '{1}'.

source: Operator '{0}' can't be applied to operands of type '{1}' and '{2}'.
ru: Оператор '{0}' не может быть использован с операндами типов '{1}' и '{2}'.

source: The module can't import itself.
ru: Модуль не может импортировать сам себя.

source: Unknown type in expression.
ru: Неизвестный тип в выражении.

source: Variable '{0}' cannot be declared because another variable or constant with same name already exists.
ru: Переменная '{0}' не может быть объявлена, так как другая переменная или константа с данным именем уже объявлена.

source: Variable '{0}' is not declared in this context.
ru: Переменная '{0}' не объявлена в текущем контексте.
